
# tap repositories and their packages

tap 'homebrew/core'
brew 'bat'
brew 'bat-extras'
brew 'boost'
brew 'brotli'
brew 'ca-certificates'
brew 'cairo'
brew 'dav1d'
brew 'deno'
brew 'double-conversion'
brew 'edencommon'
brew 'fb303'
brew 'fbthrift'
brew 'ffmpeg'
brew 'figlet'
brew 'fizz'
brew 'fmt'
brew 'folly'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fribidi'
brew 'fzy'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnu-sed'
brew 'graphite2'
brew 'harfbuzz'
brew 'icu4c@78'
brew 'jpeg-turbo'
brew 'jq'
brew 'lame'
brew 'lazygit'
brew 'libevent'
brew 'libgit2'
brew 'libidn2'
brew 'libpng'
brew 'libsodium'
brew 'libspiro'
brew 'libssh2'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libuninameslist'
brew 'libunistring'
brew 'libuv'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lpeg'
brew 'lua'
brew 'luajit'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mise'
brew 'mpdecimal'
brew 'ncurses'
brew 'neovim'
brew 'nnn'
brew 'omekasy'
brew 'oniguruma'
brew 'openssl@3'
brew 'opus'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pixman'
brew 'powerlevel10k'
brew 'progress'
brew 'python-tk@3.11'
brew 'python@3.11'
brew 'python@3.14'
brew 'readline'
brew 'ripgrep'
brew 'ruby'
brew 'sdl2'
brew 'snappy'
brew 'sqlite'
brew 'svt-av1'
brew 'tcl-tk'
brew 'tcl-tk@8'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'tree-sitter@0.25'
brew 'unibilium'
brew 'usage'
brew 'utf8proc'
brew 'uv'
brew 'vim'
brew 'visidata'
brew 'wangle'
brew 'watchman'
brew 'wget'
brew 'woff2'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xq'
brew 'xxhash'
brew 'xz'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zstd'

tap 'homebrew/cask'
cask '1password-cli'
cask 'claude-code'
cask 'cmux'
cask 'comfyui'

tap 'd-kuro/tap'
brew 'gwq'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'Actions (4.0.1)', id: 1586435171
mas 'Amazon Kindle (7.54)', id: 302584613
mas 'AS Timer (6.1)', id: 512464723
mas 'Bear (2.7)', id: 1091189122
mas 'Command X (1.6.2)', id: 6448461551
mas 'DemoPro (2.2.1)', id: 1384206666
mas 'Dropover (5.2.2)', id: 1355679052
mas 'GitStars (1.0.0)', id: 1112091009
mas 'LINE (26.0.2)', id: 539883307
mas 'MenubarX (1.7.6)', id: 1575588022
mas 'QR Capture (2.6.10)', id: 1369524274
mas 'RunCat (12.5)', id: 1429033973
mas 'Service Station (2020.9)', id: 1503136033
mas 'SideNotes (1.5.3)', id: 1441958036
mas 'Simple Recorder (1.9)', id: 989175722
mas 'Snipposé (1.8)', id: 1140313689
mas 'Translate Tab (2.0.18)', id: 458887729
mas 'Unclutter (2.2.16)', id: 577085396
mas 'WireGuard (1.0.16)', id: 1451685025
