
# tap repositories and their packages

tap 'homebrew/core'
brew 'act'
brew 'anyenv'
brew 'asciinema'
brew 'autoconf'
brew 'bat'
brew 'berkeley-db'
brew 'cairo'
brew 'clang-format'
brew 'cocoapods'
brew 'composer'
brew 'docui'
brew 'entr'
brew 'exa'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'fzy'
brew 'gawk'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'git-ftp'
brew 'git-recent'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'go'
brew 'gobject-introspection'
brew 'graphite2'
brew 'harfbuzz'
brew 'highlight'
brew 'htop'
brew 'hub'
brew 'icdiff'
brew 'icu4c'
brew 'jpeg'
brew 'jq'
brew 'libevent'
brew 'libffi'
brew 'libidn2'
brew 'libimobiledevice'
brew 'libplist'
brew 'libpng'
brew 'libpthread-stubs'
brew 'libspiro'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libuninameslist'
brew 'libunistring'
brew 'libusb'
brew 'libusbmuxd'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'lua'
brew 'lzo'
brew 'mas'
brew 'mpdecimal'
brew 'mpfr'
brew 'ncurses'
brew 'nkf'
brew 'nnn'
brew 'node'
brew 'node-build'
brew 'nodenv'
brew 'oniguruma'
brew 'openssl@1.1'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pixman'
brew 'pkg-config'
brew 'prettier'
brew 'progress'
brew 'python@3.8'
brew 'python@3.9'
brew 'q'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby'
brew 'shfmt'
brew 'sqlite'
brew 'tcl-tk'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tmuxinator'
brew 'translate-shell'
brew 'trash'
brew 'tree'
brew 'utf8proc'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'wp-cli'
brew 'xorgproto'
brew 'xz'
brew 'yarn'
brew 'z'
brew 'zplug'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

tap 'homebrew/bundle'

tap 'homebrew/cask'
cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'bartender'
cask 'betterzip'
cask 'charles'
cask 'dash'
cask 'docker'
cask 'dozer'
cask 'dropbox'
cask 'gas-mask'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'graphiql'
cask 'graphql-playground'
cask 'gyazo'
cask 'insomnia'
cask 'iterm2'
cask 'james'
cask 'karabiner-elements'
cask 'keycastr'
cask 'mapture'
cask 'notion'
cask 'obs'
cask 'obs-virtualcam'
cask 'pennywise'
cask 'pomello'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'react-native-debugger'
cask 'rightfont'
cask 'runjs'
cask 'sketch'
cask 'sketchpacks'
cask 'spectacle'
cask 'steam'
cask 'typora'
cask 'visual-studio-code'
cask 'webstorm'
cask 'zeplin'

tap 'eth-p/software'
brew 'bat-extras'

tap 'knqyf263/pet'
brew 'pet'

tap 'nektos/tap'

tap 'nodenv/nodenv'
brew 'jetbrains-npm'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'romkatv/powerlevel10k'
brew 'powerlevel10k'

tap 'sanemat/font'
brew 'ricty', args: ['with-powerline']

tap 'saulpw/vd'
brew 'visidata'

tap 'skanehira/docui'

tap 'songmu/tap'
brew 'blogsync'

# Other Homebrew packages
brew 'unrar'

# App Store applications
mas 'Affinity Designer (1.9.1)', id: 824171161
mas 'Agenda (12.0.2)', id: 1287445660
mas 'Amphetamine (5.1.1)', id: 937984704
mas 'Annotate (2.1.4)', id: 918207447
mas 'AS Timer (5.3)', id: 512464723
mas 'Be Focused Pro (2.0.2)', id: 961632517
mas 'Bear (1.8.2)', id: 1091189122
mas 'Blotter (2.2.5)', id: 406580224
mas 'com.apptorium.Workspaces (1.5.1)', id: 1219826448
mas 'CommentScreen (1.0.8)', id: 1450950860
mas 'Day One (5.6.1)', id: 1055511498
mas 'Diarly (2.0.6)', id: 1387167765
mas 'Dropzone 4 (4.1.4)', id: 1485052491
mas 'Effortless (2.0.25)', id: 1368722917
mas 'Fotor Photo Editor (3.6.2)', id: 503039729
mas 'GarageBand (10.3.5)', id: 682658836
mas 'Gemini 2 (2.6.12)', id: 1090488118
mas 'GitStars (1.0.0)', id: 1112091009
mas 'GoodNotes (5.6.46)', id: 1444383602
mas 'Helium (2.0)', id: 1054607607
mas 'iMovie (10.1.14)', id: 408981434
mas 'Kaomoji Lover (2.2.1)', id: 914708191
mas 'Keynote (10.3.8)', id: 409183694
mas 'LINE (6.7.0)', id: 539883307
mas 'LINER (5.53.0)', id: 1463530746
mas 'Lungo (1.9.0)', id: 1263070803
mas 'Magnet (2.5.0)', id: 441258766
mas 'Meeter (1.9.3)', id: 1510445899
mas 'MindNode (2021.1.3)', id: 1289197285
mas 'Monosnap (4.7.0)', id: 540348655
mas 'MouseHider (3.5.1)', id: 894419721
mas 'Numbers (10.2)', id: 409203825
mas 'Pages (10.2)', id: 409201541
mas 'Pixave (2.3.13)', id: 924891282
mas 'Pixelmator (3.9.2)', id: 407963104
mas 'RunCat (9.0)', id: 1429033973
mas 'ScreenPointer (5.7)', id: 1368204906
mas 'Service Station (2020.9)', id: 1503136033
mas 'SideNotes (1.2.6)', id: 1441958036
mas 'Simple Recorder (1.9)', id: 989175722
mas 'Sip (4.5.2)', id: 507257563
mas 'SnipEdges (1.0)', id: 528982018
mas 'SnippetsLab (1.9.3)', id: 1006087419
mas 'Snipposé (1.8)', id: 1140313689
mas 'Sorted (3.6.6)', id: 1306893526
mas 'Tayasui Sketches Pro (6.1)', id: 1031566200
mas 'Things (3.13.9)', id: 904280696
mas 'Translate Tab (2.0.14)', id: 458887729
mas 'Tweetbot (3.5.2)', id: 1384080005
mas 'Twitter (8.57)', id: 1482454543
mas 'Unclutter (2.1.24)', id: 577085396
mas 'Vectornator (3.5.16)', id: 1219074514
mas 'Workspaces (2.0.3)', id: 1540284555
mas 'Xcode (11.7)', id: 497799835
mas 'Yoink (3.5.14)', id: 457622435
mas 'Zoom It (1.2.4)', id: 476272252
