
# tap repositories and their packages

tap 'homebrew/core'
brew 'act'
brew 'anyenv'
brew 'asciinema'
brew 'autoconf'
brew 'bat'
brew 'cairo'
brew 'composer'
brew 'exa'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'fzy'
brew 'gawk'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'git-ftp'
brew 'git-recent'
brew 'glib'
brew 'gmp'
brew 'go'
brew 'graphite2'
brew 'harfbuzz'
brew 'htop'
brew 'hub'
brew 'icdiff'
brew 'icu4c'
brew 'jpeg'
brew 'jq'
brew 'libevent'
brew 'libffi'
brew 'libimobiledevice'
brew 'libplist'
brew 'libpng'
brew 'libspiro'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libuninameslist'
brew 'libusb'
brew 'libyaml'
brew 'libzip'
brew 'lua'
brew 'lzo'
brew 'mas'
brew 'mpfr'
brew 'ncurses'
brew 'nkf'
brew 'nnn'
brew 'node-build'
brew 'nodenv'
brew 'oniguruma'
brew 'openssl@1.1'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pixman'
brew 'pkg-config'
brew 'progress'
brew 'python@3.8'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tmuxinator'
brew 'translate-shell'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'utf8proc'
brew 'vim'
brew 'watchman'
brew 'wp-cli'
brew 'xz'
brew 'yarn'
brew 'zplug'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

tap 'homebrew/cask'
cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'bartender'
cask 'charles'
cask 'dash'
cask 'docker'
cask 'gas-mask'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'graphiql'
cask 'graphql-playground'
cask 'insomnia'
cask 'iterm2'
cask 'james'
cask 'karabiner-elements'
cask 'mapture'
cask 'notion'
cask 'obs'
cask 'obs-virtualcam'
cask 'pennywise'
cask 'pomello'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'react-native-debugger'
cask 'rightfont'
cask 'runjs'
cask 'sketch'
cask 'sketchpacks'
cask 'spectacle'
cask 'typora'
cask 'visual-studio-code'
cask 'webstorm'
cask 'zeplin'

tap 'knqyf263/pet'
brew 'pet'

tap 'nektos/tap'

tap 'nodenv/nodenv'
brew 'jetbrains-npm'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'romkatv/powerlevel10k'
brew 'powerlevel10k'

tap 'sanemat/font'
brew 'ricty', args: ['{args:', 'with-powerline}']

tap 'saulpw/vd'
brew 'visidata'

tap 'skanehira/docui'
brew 'docui'

# Other Homebrew packages
brew 'openssl'
brew 'python'
brew 'usbmuxd'

# Other Cask applications
cask 'BetterZip'

# App Store applications
mas 'Affinity', id: id:
mas 'Bear', id: 1091189122
mas 'GarageBand', id: 682658836
mas 'GitStars', id: 1112091009
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'MindNode', id: 1289197285
mas 'Monosnap', id: 540348655
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixave', id: 924891282
mas 'Pixelmator', id: 407963104
mas 'Sip', id: 507257563
mas 'Translate', id: id:
mas 'Tweetbot', id: 1384080005
mas 'Unclutter', id: 577085396
